# Для натурального числа К напечатать фразу «мы нашли К грибов в лесу», согласовав окончание
# слова «гриб» с числом К.


K = int(input('Введите количество найденных грибов:'))
if K % 10 == 0:
    res = 'грибов'
elif K == 11 or K == 12 or K == 13 or K == 14 or K == 15 or K == 16 or K == 17 or K == 18 or K == 19:
    res = 'грибов'
elif (K // 10) % 10 == 1:
    res = 'грибов'
elif K % 10 == 1:
    res = 'гриб'
elif K % 10 == 2 or K % 10 == 3 or K % 10 == 4:
    res = 'гриба'
elif K % 10 == 5 or K % 10 == 6 or K % 10 == 7 or K % 10 == 8 or K % 10 == 9:
    res = 'грибов'

print(f"мы нашли {K} {res} в лесу")

